# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [12]:
import pandas as pd
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [3]:
temp = pd.read_csv(r".\Temp_States.csv")

#### Print `temp`.

In [4]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [6]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
# the data types are as seen before (jose says it is one measure and two dimensions)

#### Select the rows where state is New York.

In [10]:
temp_ny = temp.loc[temp["State"] == "New York"]
temp_ny

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [13]:
np.mean(temp_ny["Temperature"])

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [14]:
temp.loc[temp["Temperature"] > 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [15]:
temp.loc[temp["Temperature"] > 15, "City"]

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [18]:
condition = (temp["Temperature"] > 15) & (temp["Temperature"] < 20)

temp[condition]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [23]:
temp.groupby("State").agg({"Temperature":["mean","std"]})

            Temperature
                   mean       std
State
Connecticut   15.833333  1.964186
New Jersey    21.111111  1.571348
New York      10.740741  8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [26]:
employees = pd.read_csv(r".\Employee.csv")

#### Explore the data types of the `employees` dataframe. Comment your results.

In [27]:
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

#### What's the average salary in this company?

In [28]:
np.mean(employees["Salary"])

48.888888888888886

#### What's the highest salary?

In [29]:
np.max(employees["Salary"])

70

#### What's the lowest salary?

In [30]:
np.min(employees["Salary"])

30

#### Who are the employees with the lowest salary?

In [31]:
condition = employees["Salary"] == 30

employees[condition]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [34]:
employees.loc[employees["Name"] == "David"]

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [33]:
employees.loc[employees["Name"] == "David", "Salary"]

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [35]:
employees.loc[employees["Title"] == "associate"]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [36]:
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [41]:
employees.loc[:2]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [42]:
condition = (employees["Salary"] > 55) & (employees["Title"] == "associate")

employees[condition]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [43]:
employees.groupby("Years").agg({"Salary":"mean"})

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [44]:
employees.groupby("Title").agg({"Salary":"mean"})

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [57]:
employees.describe().loc[["25%","50%","75%"], "Salary"]

25%    35.0
50%    55.0
75%    60.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [46]:
employees.groupby("Gender").agg({"Salary":"mean"})

        Salary
Gender
F         47.5
M         50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [56]:
employees.describe().loc[["min","mean","max"]]

         Years     Salary
min   1.000000  30.000000
mean  4.111111  48.888889
max   8.000000  70.000000

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [59]:
employees.groupby("Title").agg({"Salary": lambda x: max(x)-min(x)})

           Salary
Title
VP              0
analyst         5
associate       5

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

####  What is the average purchase price?

#### What are the highest and lowest purchase prices?

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here